АлогистикТест2/src/Documents/алк_ПеремещениеПорт/алк_ПеремещениеПорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеПорт</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаВнешнихСкладахСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ПеремещениеПорт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСписанияПорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеПортЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.КоличествоПакетов,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПеремещениеПортЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияПриход,
		|	&Период,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.КоличествоПакетов,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Заказ,
		|	алк_ПеремещениеПортЗапасы.Ссылка.ОрганизацияПолучатель,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_ПеремещениеПортЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	алк_ПеремещениеПортЗапасы.Количество КАК Количество,
		|	алк_ПеремещениеПортЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияПриход,
		|	алк_ПеремещениеПортЗапасы.Ссылка.ОрганизацияПолучатель,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_ПеремещениеПортЗапасы.СерийныйНомер
		|	КОНЕЦ,
		|	алк_ПеремещениеПортЗапасы.Количество,
		|	алк_ПеремещениеПортЗапасы.Ссылка
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСписанияПорт);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаАктСписанияПорт.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[1].Выгрузить());
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли
